[
  {
    "Role Definition": "This service domain handles all automated aspects of operating the ATM network. This includes tracking the movement of cash and documents through the network and its ATM devices. It also handles the detection and response to device errors and alerts, including overseeing the physical movement of cash and documents and the handling of device alerts and outages",
    "Folder Name": "Financial Instrument Management",
    "Core Business Object": "ATM Network Operations",
    "Example of Use": "A bank tracks the distribution and retrieval of cash inventory across its ATM network of operations",
    "Executive Summary": "Handling the automated operation of the ATM network and linked devices, including tracing physical cash and document movements",
    "Key Features": [
      "Handle the distribution/deposit of cash through the ATM network",
      "Handle the capture and generation of ATM transaction related documentation",
      "Detect and respond to ATM device errors and outages"
    ],
    "API BIAN Portal Link": "https://app.swaggerhub.com/apis/BIAN-3/ATMNetworkOperations/12.0.0",
    "Served By": ["Not specified"],
    "Serves": ["Financial Instrument Management"],
    "Triggered By": ["ATM Network Management"],
    "Triggers": ["Not specified"],
    "List of Scenarios": ["Review ATM Float and Outage"]
  },
  {
    "Role Definition": "This service domain handles the scheduling and secure distribution of currency throughout the branch network (for bank branches and remote ATM locations). It ensures the required float is maintained at locations and undertakes the movement into and out of central currency holding facilities as necessary to ensure cash availability",
    "Folder Name": "Financial Instrument Management",
    "Core Business Object": "Cash Distribution Procedure",
    "Example of Use": "ATMs at a branch location are stocked with currency in response to anticipated customer demand",
    "Executive Summary": "Schedule and coordinate the secure distribution of cash inventory across the branch and ATM networks",
    "Key Features": [
      "Distribution vehicle fleet administration",
      "Distribution planning and scheduling",
      "Distribution activity monitoring and control",
      "Central cash access coordination"
    ],
    "API BIAN Portal Link": "https://app.swaggerhub.com/apis/BIAN3/BranchCurrencyDistribution/12.0.0",
    "Served By": ["Currency Exchange"],
    "Serves": ["Financial Instrument Management"],
    "Triggered By": ["Central Cash Handling"],
    "Triggers": ["Servicing Event History", "Branch Location Operations"],
    "List of Scenarios": ["Process Inventory of Cash and Distribution of Cash to Branches"]
  },
  {
    "Role Definition": "This service domain is responsible for tracking the available cash (currency) inventory held and distributed within the Branch location to teller and ATM positions, to ensure adequate float is always available at all positions. Also to check balances and see that excess cash is transferred to secure central storage as appropriate. If necessary specific criteria can be selected to refine the allocation",
    "Folder Name": "Financial Instrument Management",
    "Core Business Object": "Branch Currency Management",
    "Example of Use": "The branch management reviews the available float and confirms end of day balances at the teller positions",
    "Executive Summary": "Track cash inventory, project demand and ensure all cash is accounted for within the branch",
    "Key Features": [
      "Cash inventory usage and availability tracking",
      "Branch cash inventory requirements evaluation and planning",
      "Oversight of cash availability and movements within the branch"
    ],
    "API BIAN Portal Link": "https://app.swaggerhub.com/apis/BIAN-3/BranchCurrencyManagement/12.0.0",
    "Served By": ["Not specified"],
    "Serves": ["Financial Instrument Management", "Financial Instrument Custodial Management", "Financial Instrument Inventory Management"],
    "Triggered By": ["ATM Network Management"],
    "Triggers": ["Not specified"],
    "List of Scenarios": ["Review ATM Float and Outage"]
  },
  {
    "Role Definition": "This service domain is responsible for tracking the available cash inventory held centrally and distributed/collected throughout the branch/ATM network and making allocation/redistribution requests to ensure adequate float is available at all locations and that excess cash at any location is transferred to central secure locations as appropriate. Also coordinating with other banks and central banks to ensure sufficient cash is on hand to support the branch network requirements",
    "Folder Name": "Financial Instrument Management",
    "Core Business Object": "Central Cash Allocation",
    "Example of Use": "The central cash management function reviews the current and projected available float at locations across the network to ensure adequate supply to meet projected demand",
    "Executive Summary": "Track cash inventory, project demand and allocate inventory across the branch/ATM network",
    "Key Features": [
      "Cash inventory usage and availability tracking",
      "Cash inventory requirements evaluation and planning",
      "Cash float availability and allocation oversight"
    ],
    "API BIAN Portal Link": "https://app.swaggerhub.com/apis/BIAN3/CentralCashHandling/12.0.0",
    "Served By": ["Branch Location Operations"],
    "Serves": ["Financial Instrument Management"],
    "Triggered By": ["Branch Location Operations"],
    "Triggers": ["Branch Currency Distribution"],
    "List of Scenarios": ["Process Inventory of Cash and Distribution of Cash to Branches"]
  },
  {
    "Role Definition": "Corporate actions cover a range of activities that directly impact the share price and hence the shareholders of a company. The main types of corporate action include stock splits and reversals, dividend (both cash and stock), rights issues, mergers and acquisitions and spin-offs. This service domain handles the required processing for a customer's securities that are held in custody by the bank",
    "Folder Name": "Financial Instrument Management",
    "Core Business Object": "Corporate Action",
    "Example of Use": "A bank processes the required custody adjustments for customers holding security in a stock that is split by its issuing company",
    "Executive Summary": "This Service Domain supports the various custodial tasks associated with processing associated corporate actions for customer's with securities held at the bank",
    "Key Features": [
      "Custodial stock split/reversal processing",
      "Custodial security dividend payment processing",
      "Custodial security rights issue processing",
      "Custodial security mergers and acquisition processing",
      "Custodial security spin-off processing"
    ],
    "API BIAN Portal Link": "https://app.swaggerhub.com/apis/BIAN-3/CorporateAction/12.0.0",
    "Served By": ["Not specified"],
    "Serves": ["Financial Instrument Management"],
    "Triggered By": ["Not specified"],
    "Triggers": ["Not specified"],
    "List of Scenarios": ["Not specified"]
  },
  {
    "Role Definition": "This is an over the counter service where currency is exchanged and the transaction uses preferential rates and can include transaction fees. Note in some cases travelers checks can be handled as a pseudo currency within this capability. Note that Branch and teller currency inventory tracking and distribution is administered by Branch Currency Management and Branch Currency Distribution service domains",
    "Folder Name": "Financial Instrument Management",
    "Core Business Object": "Currency Exchange",
    "Example of Use": "A non-bank customer obtains a currency exchange at the teller, buying foreign currency for local currency in cash",
    "Executive Summary": "Service Domain supports over the counter currency exchange",
    "Key Features": [
      "FX transaction pricing",
      "FX transaction capture",
      "Document handling"
    ],
    "API BIAN Portal Link": "https://app.swaggerhub.com/apis/BIAN-3/CurrencyExchange/12.0.0",
    "Served By": ["Not specified"],
    "Serves": ["Financial Instrument Management"],
    "Triggered By": ["Business Unit Management", "Business Development"],
    "Triggers": ["Branch Currency Distribution", "Corporate Treasury", "Current Account", "Financial Accounting"],
    "List of Scenarios": ["Not specified"]
  },
  {
    "Role Definition": "Administer the securities scrip (paper and electronic) holdings for a custodial arrangement. This includes administering the physical movements of securities, safe storage, the processing of associated dividends and interest and securities reporting",
    "Folder Name": "Financial Instrument Management",
    "Core Business Object": "Custody Facility",
    "Example of Use": "A customer uses the banks custodial services to handle their investment portfolio holdings",
    "Executive Summary": "A service to provide safe custody services for marketable securities for bank customers",
    "Key Features": [
      "Administer securities movements",
      "Arrange safe storage",
      "Process dividends and interest against securities",
      "Report on securities holdings",
      "Determine and apply service fees"
    ],
    "API BIAN Portal Link": "https://app.swaggerhub.com/apis/BIAN3/CustodyAdministration/12.0.0",
    "Served By": ["None specified"],
    "Serves": ["Financial Instrument Management"],
    "Triggered By": ["None specified"],
    "Triggers": ["None specified"],
    "List of Scenarios": ["None specified"]
  },
  {
    "Role Definition": "The service domain provides fulfillment services for the issuance of primary market equity and debt capital market instruments for corporate customers. It supports both private and public (IPO) placements and covers the specification, pricing and placement activities associated with issuance. (it does not include secondary market trading of the instrument)",
    "Folder Name": "Financial Instrument Management",
    "Core Business Object": "Capital Market Agreement",
    "Example of Use": "A corporate customer raises capital through issuing corporate debt in the private capital markets",
    "Executive Summary": "Supports the specification, pricing and issuance of equity and debt (bond) primary capital market products for corporate financing services",
    "Key Features": [
      "Determining and specifying the equity/debt instrument",
      "Prospectus and pricing",
      "Road show and placement"
    ],
    "API BIAN Portal Link": "https://app.swaggerhub.com/apis/BIAN-3/ECMAndDCM/12.0.0",
    "Served By": ["Customer Relationship Management", "ECM And DCM"],
    "Serves": ["Financial Instrument Management"],
    "Triggered By": ["Customer Relationship Management", "ECM And DCM"],
    "Triggers": ["Term Deposit", "Interbank Relationship Management", "Payment Order", "Asset And Liability Management", "Suitability Checking", "ECM And DCM", "Guideline Compliance", "Corporate Loan"],
    "List of Scenarios": ["Handle Request for Issuance of Commercial Paper"]
  },
  {
    "Role Definition": "Maintain a central reference directory of market traded asset/instrument details. The details are typically captured from one or more specialist market feeds that publish market asset/instrument details. It can include the result of internal reference data processing",
    "Folder Name": "Financial Instrument Management",
    "Core Business Object": "Financial Instrument Directory Entry",
    "Example of Use": "A corporate financial advisory project references different instrument specifications when assembling a structured financial approach to the customer financing needs",
    "Executive Summary": "This Service Domain maintains a directory of financial instrument reference data",
    "Key Features": [
      "Consolidate reference data from market sources",
      "Classify and verify reference data",
      "Organize reference data for ease of access",
      "Provide access to instrument reference data"
    ],
    "API BIAN Portal Link": "https://app.swaggerhub.com/apis/BIAN3/FinancialInstrumentReferenceDataManagement/12.0.0",
    "Served By": ["None specified"],
    "Serves": ["Financial Instrument Management", "Financial Instrument Association Management", "Financial Instrument to Information Association"],
    "Triggered By": ["None specified"],
    "Triggers": ["None specified"],
    "List of Scenarios": ["None specified"]
  },
  {
    "Role Definition": "Provide securities/asset valuation services. A wide range of valuation approaches can be applied to a range of different instrument/asset types. This Service Domain implements a process by which the most appropriate valuation method is selected and applied in the context of the valuation request and the purpose of the valuation. The fundamental pricing principle is based on an analysis of the present value of expected cash flows. This calculation involves identifying the expected cash flows, determining appropriate (range of)interest rates that might discount future cash flows and calculate the current value of future cash flows applying those interest rates",
    "Folder Name": "Financial Instrument Management",
    "Core Business Object": "Market Asset Valuation Procedure",
    "Example of Use": "The assets held in an investment portfolio are subject to valuation as part of an annual performance report",
    "Executive Summary": "This Service Domain provides a range of financial asset valuation services",
    "Key Features": [
      "Support the selection from various financial asset valuation approaches (e.g. market, income, replacement) and depending on the type of financial asset and valuation context",
      "Consolidate information supporting the valuation assessment",
      "Determine and report on the financial asset valuation"
    ],
    "API BIAN Portal Link": "https://app.swaggerhub.com/apis/BIAN3/FinancialInstrumentValuation/12.0.0",
    "Served By": ["Consumer Investments"],
    "Serves": ["Financial Instrument Management", "Financial Instrument Valuation"],
    "Triggered By": ["None specified"],
    "Triggers": ["None specified"],
    "List of Scenarios": ["None specified"]
  },
  {
    "Role Definition": "Develop and maintain a portfolio of valuation models considering currency, interest rate, instrument quotes, indices, commodity prices and other market, liquidity and credit risk factors. Support the use of these models in trading and pricing activity",
    "Folder Name": "Financial Instrument Management",
    "Core Business Object": "Market Asset Valuation Model Specification",
    "Example of Use": "Financial engineers assess the coverage and currency of the portfolio of valuation models and update certain models accordingly",
    "Executive Summary": "Not explicitly provided in the document",
    "Key Features": [
      "Develop and maintain valuation models",
      "Consider various risk factors",
      "Support trading and pricing activities"
    ],
    "API BIAN Portal Link": "Not specified in the document",
    "Served By": ["Collateral Asset Administration", "Investment Portfolio Analysis"],
    "Serves": ["Financial Instrument Management", "Financial Instrument Valuation"],
    "Triggered By": ["None specified"],
    "Triggers": ["None specified"],
    "List of Scenarios": ["None specified"]
  },
  {
    "Role Definition": "Private placement covers the definition, pricing, placing and all supporting actions involved for a private offering of corporate equity or debt. A private placement avoids many of the more stringent regulatory constraints of a public offering but can only be placed with accredited investors. The associated equity or debt securities issued by the corporate do not need to be registered with the regulatory authorities.",
    "Folder Name": "Financial Instrument Management",
    "Core Business Object": "Private Placement",
    "Example of Use": "The Corporate Finance unit of an investment bank provides support to a corporate customer with a private placement in order to raise finds for a planned expansion of their manufacturing capacity",
    "Executive Summary": "This Service Domain provides the complete range of functions involved in providing private placement services to corporate customers.",
    "Key Features": [
      "Determine and specify the optimum financing mechanism (debt or equity)",
      "Package the debt/equity security for investors",
      "Place the loan with accredited investors",
      "Process equity/debt instrument maintenance and fulfillment actions"
    ],
    "API BIAN Portal Link": "https://app.swaggerhub.com/apis/BIAN-3/PrivatePlacement/12.0.0",
    "Served By": ["Not specified"],
    "Serves": ["Financial Instrument Management"],
    "Triggered By": ["Not specified"],
    "Triggers": ["Not specified"],
    "List of Scenarios": ["Not specified"]
  },
  {
    "Role Definition": "A public offering involves the specification and packaging of corporate equity or bonds in the public markets to raise capital. This can be the initial public offering (IPO) when a private company is first taken public, and secondary/follow-on offerings to raise further capital. IPO's involve a broad range of financial analysis, auditing and regulatory approval actions. A lead bank and several underwriting banks may coordinate to underwrite the initiative. Secondary offerings can be dilutive (create additional shares) or non-dilutive (redistribute existing shares).",
    "Folder Name": "Financial Instrument Management",
    "Core Business Object": "Public Offering",
    "Example of Use": "An investment bank assembles a consortia of banks as lead bank to orchestrate an IPO for a rapidly growing private company that wishes to raise significant capital to expand its operations",
    "Executive Summary": "This Service Domain supports a broad range of complex financial, accounting and regulatory actions involved in providing advice and practical support to companies going public and/or raising additional capital through the issuance of publicly traded securities",
    "Key Features": [
      "Determine and specify the optimum financing mechanism (debt or equity)",
      "Coordinate with regulators for the approval and registration of the instrument",
      "Develop comprehensive financial and managerial assessments to support the pricing of the instrument",
      "Package the debt/equity security for public investors and undertake road-shows as necessary",
      "Coordinate as lead or secondary underwriting bank for the IPO",
      "Support the traded equity/debt instrument maintenance and fulfillment actions if necessary"
    ],
    "API BIAN Portal Link": "https://app.swaggerhub.com/apis/BIAN-3/PublicOffering/12.0.0",
    "Served By": ["Not specified"],
    "Serves": ["Financial Instrument Management"],
    "Triggered By": ["Not specified"],
    "Triggers": ["Not specified"],
    "List of Scenarios": ["Not specified"]
  }
]