{
  "capability_name": "Customer Agreement",
  "role_definition": "The Customer Agreement service domain captures and maintains the master legal terms of conditions in force for a customer (which as noted can be a complex multinational with many underlying product and service specific agreements).",
  "folder_name": "Agreement Management",
  "core_business_object": "CustomerMasterAgreement",
  "example_of_use": "An new customer's master agreement is established prior to negotiating and setting up the underlying product specific agreements",
  "executive_summary": "This service domain maintains the master customer agreement/legal contract. Note that a customer can be a complex corporate entity with many subsidiaries operating in different geopolitical areas. The customer agreement is linked to as many Sales Product Agreements as needed for all in-force products",
  "key_features": [
    "Set-up and maintain the customer master agreement",
    "Ensure legal, regulatory and corporate considerations are covered in agreement",
    "Determine if proposed actions are covered by the agreement"
  ],
  "api_bian_portal_link": "https://app.swaggerhub.com/apis/BIAN-3/CustomerAgreement/12.0.0",
  "served_by": [
    "Party Lifecycle Management",
    "Payment Initiation",
    "Customer Relationship Management",
    "Term Deposit",
    "Servicing Order",
    "Corporate Current Account",
    "Cash Management And Account Services",
    "Current Account",
    "Customer Offer",
    "Credit Card",
    "Consumer Loan",
    "Customer Proposition",
    "Bank Guarantee",
    "Lead and Opportunity Management",
    "Limit and Exposure Management"
  ],
  "serves": [
    "Agreement Management"
  ],
  "triggered_by": [
    "Party Lifecycle Management",
    "Payment Initiation", 
    "Customer Relationship Management",
    "Mortgage Loan",
    "Servicing Order",
    "Corporate Current Account",
    "Payment Order",
    "Current Account",
    "Customer Offer",
    "Corporate Loan",
    "Consumer Loan",
    "Customer Case",
    "Loan Syndication"
  ],
  "triggers": [
    "Customer master agreement establishment",
    "Legal terms evaluation",
    "Regulatory compliance checks",
    "Corporate policy updates"
  ],
  "list_of_scenarios": [
    "Set Up New Card for Card Application",
    "Initiate Payment Order",
    "EXT Handle Request to Move Overdraft Limit between Virtual Accounts",
    "EXT Handle Request for High Volume Account Opening",
    "Execute Customer Onboarding API version",
    "Handle Request for Notional Pooling Agreement",
    "Handle Request for Loan that Requires Syndication",
    "Process Closing of Corporate Loan",
    "EXT Handle Customer Relationships Case",
    "Handle Request for Corporate Loan",
    "EXT Handle Bulk Request for Opening Salary Accounts",
    "Handle Request for Preferential Rates for Corporate Current Account",
    "EXT Handle Request for High Volume Virtual Account Opening",
    "Handle Request for Product Selection",
    "Handle Bulk Request for Opening Salary Accounts",
    "Process Closing of Mortgage Loan",
    "EXT Handle Request for Preferential Rates for Corporate Current Account",
    "Handle Request for Consumer Loan Checks and Options",
    "EXT Handle Request to Open Corporate Current Account",
    "EXT Handle Request to Open Virtual Account",
    "Handle Request to Open Corporate Current Account",
    "EXT Handle Request to Establish Term Deposit Agreement",
    "Handle Request to Establish Term Deposit Agreement"
  ]
}