{
  "capability_name": "Leasing",
  "role_definition": "The Service Domain fulfills a general leasing arrangement for a single leased product or facility. The bank will take a collateral interest in the leased item to underwrite the associated loan/lease arrangement",
  "folder_name": "Agreement Management",
  "core_business_object": "Leasing Facility",
  "example_of_use": "A customer requests a leasing arrangement to support the acquisition of equipment",
  "executive_summary": "The leasing products enables customers to finance equipment purchases using the leased item as collateral when necessary",
  "key_features": [
    "Evaluate proposed leasing arrangement",
    "Review collateral value and title of leased item",
    "Price/structure the leasing arrangement",
    "Negotiate and agree leasing arrangement",
    "Initiate and maintain the leasing arrangement through term"
  ],
  "api_bian_portal_link": "https://app.swaggerhub.com/apis/BIAN-3/Leasing/12.0.0",
  "served_by": [
    "Loans and Deposits"
  ],
  "serves": [
    "Agreement Management"
  ],
  "triggered_by": [],
  "triggers": [],
  "list_of_scenarios": [
    "Accept, verify, etc. aspects of Fees processing",
    "Instantiate a new Fees",
    "Accept, verify, etc. aspects of Lien processing",
    "Accept, verify, etc. aspects of Sweep processing",
    "Update details relating to Fees",
    "Update details relating to Corporate Action",
    "Retrieve details about any aspect of Fees",
    "Retrieve details about any aspect of Lien",
    "Instantiate a new Collateral",
    "Request manual intervention or a decision with respect to Fees",
    "Retrieve Interest",
    "Update details relating to Deposits",
    "Request manual intervention or a decision with respect to Collateral",
    "Retrieve details about any aspect of Withdrawals",
    "Instantiate a new Corporate Action",
    "Instantiate a new Financial Instrument",
    "Update details relating to Financial Instrument",
    "Update details relating to Sweep",
    "Update details relating to Withdrawals",
    "Retrieve details about any aspect of Issued Device",
    "Accept, verify, etc. aspects of Payments processing",
    "Retrieve details about any aspect of Payments",
    "Update details relating to Payments",
    "Update details relating to Collateral",
    "Update details relating to Lien",
    "Instantiate a new Payments",
    "Instantiate a new Sweep",
    "Control the processing of Leasing Facility",
    "Instantiate a new Issued Device",
    "Instantiate a new Lien",
    "Instantiate a new Deposits",
    "Retrieve details about any aspect of Collateral",
    "Retrieve details about any aspect of Deposits",
    "Update details relating to Clearing and Settlement",
    "Execute an available automated action for Leasing Facility",
    "Update details relating to Issued Device",
    "Instantiate a new Leasing Facility",
    "Update Interest",
    "Instantiate a new Withdrawals",
    "Accept, verify, etc. aspects of Leasing Facility processing",
    "Retrieve details about any aspect of Clearing and Settlement",
    "Retrieve details about any aspect of Sweep",
    "Retrieve details about any aspect of Corporate Action",
    "Retrieve details about any aspect of Financial Instrument",
    "Update details relating to Leasing Facility",
    "Retrieve details about any aspect of Leasing Facility",
    "Request manual intervention or a decision with respect to Leasing Facility"
  ]
}